
#ifndef PRNTCHAR_H
#define PRNTCHAR_H
//أءآابپتثجچحخدذرزژسشصضطظعغفقکگلمنوهی
//From PC
//000A.0623.0621.0622.0627.0628.067E.062A.062B.062C.0686.062D.062E.062F.0630.0631.0632.0698.0633.0634.0635.0636.0637.0638.0639.063A.0641.0642.06A9.06AF.0644.0645.0646.0648.0647.06CC
//060C.،
//061F.؟
//0621.ء
//0622.آ
//......
//0626.ئ
//0627.ا
//0628.ب
//0629.ة
//062A.ت
//062B.ث
//062C.ج
//062D.ح
//062E.خ
//062F.د
//0630.ذ
//0631.ر
//0632.ز
//0633.س
//0634.ش
//0635.ص
//0636.ض
//0637.ط
//0638.ظ
//0639.ع
//063A.غ
//......
//0641.ف
//0642.ق
//0643.ك
//0644.ل
//0645.م
//0646.ن
//0647.ه
//0648.و
//......
//067E.پ
//0686.چ
//0698.ژ
//06A9.ک
//06AF.گ
//06CC.ی
//......
//0660.٠
//0661.١
//0662.٢
//0663.٣
//0664.٤
//0665.٥
//0666.٦
//0667.٧
//0668.٨
//0669.٩
//......
//06F0.۰
//06F1.۱
//06F2.۲
//06F3.۳
//06F4.۴
//06F5.۵
//06F6.۶
//06F7.۷
//06F8.۸
//06F9.۹
#define DEBUG_CHAR		0xCE
#define PRNT_QUAD_MSK	7
static unsigned char PrntQuadMask[] = {
	0x26,
	0x39,
	0x3A,
	0x47,
	0xCC
};
static unsigned char PrntQuadChar[] = {
//	ﻍ		ﻎ		ﻐ		ﻏ
	0x8F	,0x8E	,0x8E	,0x90,		//ء ئ ئ ا
//	0x90	,0x91	,0x91	,0x8D,		//ا
	0xE1	,0xE2	,0xE3	,0xE4,		//ع
	0xE5	,0xE6	,0xE7	,0xE8,		//غ
	0xF9	,0xF9	,0xFA	,0xFB,		//ه به بهب هب
	0xFD	,0xFC	,0xFE	,0xFE		//ی بی بیب یب
};
#define PRNT_DUAL_MSK	5
static unsigned char PrntDualMask[] = {
	0x28,	//ب		//first
	0x29,	//ة
	0x2A,	//ت
	0x2B,	//ث
	0x2C,	//ج
	0x2D,	//ح
	0x2E,	//خ
	0x33,	//س
	0x34,	//ش
	0x35,	//ص
	0x36,	//ض
	0x41,	//ف
	0x42,	//ق
	0x43,	//ك
	0x45,	//م
	0x46,	//ن
	0x7E,	//پ
	0x86,	//چ
	0xA9,	//ک
	0xAF,	//گ
	0x44	//ل
};
static unsigned char PrntDualChar[] = {
//	ﺙ	ﺛ
	0x92	,0x93,	//ب	0628
	DEBUG_CHAR	,DEBUG_CHAR,	//ة
	0x96	,0x97,	//ت
	0x98	,0x99,	//ث
	0x9A	,0x9B,	//ج
	0x9E	,0x9F,	//ح
	0xA0	,0xA1,	//خ
	0xA7	,0xA8,	//س
	0xA9	,0xAA,	//ش
	0xAB	,0xAC,	//ص
	0xAD	,0xAE,	//ض
	0xE9	,0xEA,	//ف
	0xEB	,0xEC,	//ق
	0xED	,0xEE,	//ک
	0xF4	,0xF5,	//م
	0xF6	,0xF7,	//ن
	0x94	,0x95,	//پ	067E
	0x9C	,0x9D,	//چ	0686
	0xED	,0xEE,	//ک	06A9
	0xEF	,0xF0,	//گ	06AF
	0XF1	,0XF3	//ل
};
static unsigned char PrntSingleMask[] = {
	0x60,	//0
	0x61,	//1
	0x62,	//2
	0x63,	//3
	0x64,	//4
	0x65,	//5
	0x66,	//6
	0x67,	//7
	0x68,	//8
	0x69,	//9
	0x0C,	// ،
	0x1F,	// ؟
	0x21,	//ء
	0x22,	//آ
	0x2F,	//د
	0x30,	//ذ
	0x31,	//ر
	0x32,	//ز
	0x37,	//ط
	0x38,	//ظ
	0x48,	//و
	0x98,	//ژ	0698
	0x27	// ا
};
static unsigned char PrntSingleChar[] = {
	0x80,	// 0	0660
	0x81,	// 1
	0x82,	// 2
	0x83,	// 3
	0x84,	// 4
	0x85,	// 5
	0x86,	// 6
	0x87,	// 7
	0x88,	// 8
	0x89,	// 9
	0x8A,	// ،	060C
	0x8C,	// ?	061F
	0x8F,	//ء
	0x8D,	//آ
	0xA2,	//د
	0xA3,	//ذ
	0xA4,	//ر
	0xA5,	//ز
	0xAF,	//ط
	0xEA,	//ظ
	0xF8,	//و
	0xA6,	//ژ	0698
	0x90,0X91	// ا
};

#endif
